# Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

# n = input()
# if n == '1':
#     print('x > 0 и y > 0')
# elif n == '2':
#     print('x < 0 and y > 0')
# elif n == '3':
#     print('x < 0 and y < 0')
# elif n == '4':
#     print('x > 0 и y < 0')


# Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

# x1 = int(input())
# y1 = int(input())
# x2 = int(input())
# y2 = int(input())
# print(round(((x2-x1)**2+(y2-y1)**2)**0.5, 2))



